<a href="https://colab.research.google.com/github/layman-Swastik/Applied-AI/blob/main/pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**<H1>[Optional Assignment] Pandas (for basic understanding) Questions:</H1>**

In [4]:
import pandas as pd
import numpy as np

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [6]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#creating the dataframe
birds = pd.DataFrame(data, index = labels)

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [7]:
print(birds) #printing DataFrame

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [11]:
birds.shape #shape of the dataframe

(10, 4)

In [32]:
birds.dtypes  #getting the data types or data domin of each column

birds        object
age         float64
visits        int64
priority     object
dtype: object

In [25]:
birds.isnull().sum(axis = 0) #checking the number of NaN values present in each column

birds       0
age         2
visits      0
priority    0
dtype: int64

In [9]:
birds.describe() #statistical summary

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [26]:
birds.head(2)

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [33]:
birds[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [50]:
birds.iloc[[2,3,7], :-1]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [52]:
birds.loc[birds['visits'] < 4 , : ]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [55]:
birds.loc[birds['age'].isnull(), ['birds', 'visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [62]:
birds.loc[(birds['birds'] == "Cranes") & (birds['age'] < 4), :]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [63]:
birds.loc[(birds['age'] >= 2) & (birds['age'] <= 4), :]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [67]:
birds['visits'][birds['birds'] == 'Cranes'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [69]:
for bird, dframe in birds.groupby('birds'):
  print("{} : {}".format(bird, dframe.age.mean()))

Cranes : 3.5
plovers : 3.5
spoonbills : 6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [109]:
print("Before appending:")
print(birds)
ind = ['a','b','c','d','e','f','g','h','i','j','k']
#appending a new row
birds = birds.append({'birds': 'Eagle', 'age': 5, 'visits':3, 'priority': 'yes'}, ignore_index=True).set_index(pd.Index(ind))
print("\nAfter appending:")
print(birds)

#deleting that row
birds.drop('k', inplace=True)
print("\nAfter deleting:")
print(birds)

Before appending:
        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

After appending:
        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k       Eagle  5.0       3      yes

After deleting:
        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [99]:
for bird, dframe in birds.groupby('birds'):
  print("{} : {}".format(bird, dframe.birds.count()))

Cranes : 4
plovers : 2
spoonbills : 4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [110]:
birds = birds.sort_values(by = ['age', 'visits'], ascending = [False, True])
birds

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [111]:
birds = birds.replace({'priority' : {'yes':1, 'no':0}})
birds

        birds  age  visits  priority
i  spoonbills  8.0       3         0
e  spoonbills  6.0       3         0
g     plovers  5.5       2         0
j  spoonbills  4.0       2         0
b      Cranes  4.0       4         1
a      Cranes  3.5       2         1
f      Cranes  3.0       4         0
c     plovers  1.5       3         0
h      Cranes  NaN       2         1
d  spoonbills  NaN       4         1

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [113]:
birds = birds.replace({'birds' : {'Cranes':'trumpeters'}})
birds

        birds  age  visits  priority
i  spoonbills  8.0       3         0
e  spoonbills  6.0       3         0
g     plovers  5.5       2         0
j  spoonbills  4.0       2         0
b  trumpeters  4.0       4         1
a  trumpeters  3.5       2         1
f  trumpeters  3.0       4         0
c     plovers  1.5       3         0
h  trumpeters  NaN       2         1
d  spoonbills  NaN       4         1